// 1. 자바스크립트 기본 개념 

//1) 활용범위: 웹 개발 , 서버개발(node.js), 애플리케이션 개발(크로스 플랫폼)

//2) 자바스크립트의 핵심 개념 
//- 객체:객체에 대한 정의와 활용 방법, 기타 원시 데이터 타입 
// -함수: 자바스크립트는 함수도 객체로 취급 /함수는 일급 객체로 다뤄짐 
// - 프로토타입: 모든 객체는 프로토타입을 지님 / 프로토타입과 프로토타입을 활용한 객체지향의 상속 구현!!
// - 실행 컨텍스트와 클로저: 실행컨텍스트는 자신만의 유효범위를 가짐 > 이로 클로저 구현 가능 
// - 자바스크립트와 객체지향 프로그래밍: 자바스크립트는 클래스를 지원하지 않지만, 객체지향 프로그램 가능 > 프로토타입과 클로저를 통해 가능 
// - 자바스크립트와 함수형 프로그래밍: 함수형 프로그래밍을 통해 높은 수준의 모듈화가 가능 > 일급객체로서의 함수 특성과 클로저로 가능 
// - 단점: 유연한 언어 > 컴파일 타임에서 잡지 못하는 오류 > 런타임 오류  